package com.grammar.运算符;

public class Demon06 {
    public static void main(String[] args) {
        //位运算
        /*
        A = 0011 1100
        B = 0000 1101
        -----------------------------
        A&B = 0000 1100     //都为1则为1，否则为0
        A|B = 0011 1101     //有一个为1就为1
        A^B = 0011 0001     //相同为0.相异为1
        ~B = 1111 0010      //按位取反

        2*8=16  2*2*2*2
        <<左移    *2
        >>右移    /2

        0000 0000   0
        0000 0001   1
        0000 0010   2
        0000 0011   3
        0000 0100   4
        0000 1000   8
        0001 0000   16

         */
        System.out.println(2<<3);  //16
    }
}
